# PolylineSegments Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
PolylineSegments Class
Members See Also
---
An output node that represents a tessellated polyline segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class PolylineSegments : IDisposable
```

Visual Basic
---
```text
Public Class PolylineSegments _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PolylineSegments : IDisposable
```

# Remarks
See also: OnPolylineSegments(PolylineSegments).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PolylineSegments
# See Also
PolylineSegments Members
Autodesk.Revit.DB Namespace